In [1]:
import pandas as pd

In [2]:
raw_data = pd.read_csv("Absenteeism_data.csv")

In [3]:
raw_data.head()

,ID,Reason for Absence,Date,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours
0,11,26,07/07/2015,289,36,33,239.554,30,1,2,1,4
1,36,0,14/07/2015,118,13,50,239.554,31,1,1,0,0
2,3,23,15/07/2015,179,51,38,239.554,31,1,0,0,2
3,7,7,16/07/2015,279,5,39,239.554,24,1,2,0,4
4,11,23,23/07/2015,289,36,33,239.554,30,1,2,1,2

In [4]:
pd.options.display.max_columns = None
pd.options.display.max_rows = None

In [5]:
# raw_data

In [6]:
# Step 1 Make a copy of orignal Data
df = raw_data.copy()
df.head()

,ID,Reason for Absence,Date,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours
0,11,26,07/07/2015,289,36,33,239.554,30,1,2,1,4
1,36,0,14/07/2015,118,13,50,239.554,31,1,1,0,0
2,3,23,15/07/2015,179,51,38,239.554,31,1,0,0,2
3,7,7,16/07/2015,279,5,39,239.554,24,1,2,0,4
4,11,23,23/07/2015,289,36,33,239.554,30,1,2,1,2

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 12 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   ID                         700 non-null    int64
 1   Reason for Absence         700 non-null    int64
 2   Date                       700 non-null    object
 3   Transportation Expense     700 non-null    int64
 4   Distance to Work           700 non-null    int64
 5   Age                        700 non-null    int64
 6   Daily Work Load Average    700 non-null    float64
 7   Body Mass Index            700 non-null    int64
 8   Education                  700 non-null    int64
 9   Children                   700 non-null    int64
 10  Pets                       700 non-null    int64
 11  Absenteeism Time in Hours  700 non-null    int64
dtypes: float64(1), int64(10), object(1)
memory usage: 65.8+ KB

In [8]:
# Step 2 Drop usless columns
df = df.drop(["ID"],axis=1)

In [9]:
# step 3 : check one by one columns to explore the data
df['Reason for Absence'].unique()

array([26,  0, 23,  7, 22, 19,  1, 11, 14, 21, 10, 13, 28, 18, 25, 24,  6,
       27, 17,  8, 12,  5,  9, 15,  4,  3,  2, 16], dtype=int64)

In [10]:
len(df['Reason for Absence'].unique())

28

In [11]:
df['Reason for Absence'].unique().min()

0

In [12]:
df['Reason for Absence'].unique().max()

28

In [13]:
#sorted(df['Reason for Absence'].unique())

In [14]:
# Step : 4 
df_dummies = pd.get_dummies(df['Reason for Absence'])

In [15]:
df_dummies.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,21,22,23,24,25,26,27,28
0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0
1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0
3,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0

In [16]:
df = df.drop(['Reason for Absence'],axis=1)
df.columns.values

array(['Date', 'Transportation Expense', 'Distance to Work', 'Age',
       'Daily Work Load Average', 'Body Mass Index', 'Education',
       'Children', 'Pets', 'Absenteeism Time in Hours'], dtype=object)

In [17]:
# Stpe 5 : if possible or needed group the column to reduce the data size
group_1 = df_dummies.loc[:,1:14].max(axis=1)
group_2 = df_dummies.loc[:,15:17].max(axis=1)
group_3 = df_dummies.loc[:,18:21].max(axis=1)
group_4 = df_dummies.loc[:,22:].max(axis=1)

In [18]:
#step 6: after creating groups of dummies concat it with the data
df= pd.concat([df,group_1,group_2,group_3,group_4],axis=1)

In [19]:
df.head()

,Date,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours,0,1,2,3
0,07/07/2015,289,36,33,239.554,30,1,2,1,4,0,0,0,1
1,14/07/2015,118,13,50,239.554,31,1,1,0,0,0,0,0,0
2,15/07/2015,179,51,38,239.554,31,1,0,0,2,0,0,0,1
3,16/07/2015,279,5,39,239.554,24,1,2,0,4,1,0,0,0
4,23/07/2015,289,36,33,239.554,30,1,2,1,2,0,0,0,1

In [20]:
# step 6: renaming of newly added columns
df.columns.values

array(['Date', 'Transportation Expense', 'Distance to Work', 'Age',
       'Daily Work Load Average', 'Body Mass Index', 'Education',
       'Children', 'Pets', 'Absenteeism Time in Hours', 0, 1, 2, 3],
      dtype=object)

In [21]:
col_names = ['Date', 'Transportation Expense', 'Distance to Work', 'Age',
       'Daily Work Load Average', 'Body Mass Index', 'Education',
       'Children', 'Pets', 'Absenteeism Time in Hours', 'Group_1','Group_2','Group_3','Group_4']
df.columns = col_names

In [22]:
df.columns.values

array(['Date', 'Transportation Expense', 'Distance to Work', 'Age',
       'Daily Work Load Average', 'Body Mass Index', 'Education',
       'Children', 'Pets', 'Absenteeism Time in Hours', 'Group_1',
       'Group_2', 'Group_3', 'Group_4'], dtype=object)

In [23]:
# Reorder the columns 
col_names_reordered = ['Group_1','Group_2','Group_3','Group_4','Date', 'Transportation Expense', 'Distance to Work', 'Age',
       'Daily Work Load Average', 'Body Mass Index', 'Education',
       'Children', 'Pets', 'Absenteeism Time in Hours']
df=df[col_names_reordered]

In [24]:
df.head()

,Group_1,Group_2,Group_3,Group_4,Date,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours
0,0,0,0,1,07/07/2015,289,36,33,239.554,30,1,2,1,4
1,0,0,0,0,14/07/2015,118,13,50,239.554,31,1,1,0,0
2,0,0,0,1,15/07/2015,179,51,38,239.554,31,1,0,0,2
3,1,0,0,0,16/07/2015,279,5,39,239.554,24,1,2,0,4
4,0,0,0,1,23/07/2015,289,36,33,239.554,30,1,2,1,2

# check points

In [25]:
# step 7 : handling the date column as it is string object in dataset
df_mod = df.copy()

In [26]:
type(df_mod['Date'])

pandas.core.series.Series

In [27]:
type(df_mod['Date'][0])

str

In [28]:
df_mod['Date']=pd.to_datetime(df_mod['Date'], format ='%d/%m/%Y')

In [29]:
type(df_mod['Date'])

pandas.core.series.Series

In [30]:
type(df_mod['Date'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [31]:
df_mod.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 14 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Group_1                    700 non-null    uint8
 1   Group_2                    700 non-null    uint8
 2   Group_3                    700 non-null    uint8
 3   Group_4                    700 non-null    uint8
 4   Date                       700 non-null    datetime64[ns]
 5   Transportation Expense     700 non-null    int64
 6   Distance to Work           700 non-null    int64
 7   Age                        700 non-null    int64
 8   Daily Work Load Average    700 non-null    float64
 9   Body Mass Index            700 non-null    int64
 10  Education                  700 non-null    int64
 11  Children                   700 non-null    int64
 12  Pets                       700 non-null    int64
 13  Absenteeism Time in Hours  700 non-null    int64
dtypes: datetime64[ns](1), float64(1), int64(8), uint8(4)
memory usage: 57.5 KB

In [32]:
# Extract the month valuyes
df_mod['Date'][0].month

7

In [33]:
list_months = []
for i in range(700):
    list_months.append(df_mod['Date'][i].month)
len(list_months)

700

In [34]:
df_mod['month'] = list_months

In [35]:
df_mod.columns.values

array(['Group_1', 'Group_2', 'Group_3', 'Group_4', 'Date',
       'Transportation Expense', 'Distance to Work', 'Age',
       'Daily Work Load Average', 'Body Mass Index', 'Education',
       'Children', 'Pets', 'Absenteeism Time in Hours', 'month'],
      dtype=object)

In [36]:
# extract the day of the week (0-6 range as week has 7 days)
df_mod['Date'][0].weekday()

1

In [37]:
def day_of_week(date_value):
    return date_value.weekday()

df_mod['day of the week'] = df_mod['Date'].apply(day_of_week)

In [38]:
df_mod.columns.values

array(['Group_1', 'Group_2', 'Group_3', 'Group_4', 'Date',
       'Transportation Expense', 'Distance to Work', 'Age',
       'Daily Work Load Average', 'Body Mass Index', 'Education',
       'Children', 'Pets', 'Absenteeism Time in Hours', 'month',
       'day of the week'], dtype=object)

In [39]:
col = ['Group_1', 'Group_2', 'Group_3', 'Group_4', 'Date','month',
       'day of the week',
       'Transportation Expense', 'Distance to Work', 'Age',
       'Daily Work Load Average', 'Body Mass Index', 'Education',
       'Children', 'Pets', 'Absenteeism Time in Hours', ]

df_mod=df_mod[col]

In [40]:
df_mod = df_mod.drop(["Date"],axis=1)

In [41]:
df_mod.head()

,Group_1,Group_2,Group_3,Group_4,month,day of the week,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours
0,0,0,0,1,7,1,289,36,33,239.554,30,1,2,1,4
1,0,0,0,0,7,1,118,13,50,239.554,31,1,1,0,0
2,0,0,0,1,7,2,179,51,38,239.554,31,1,0,0,2
3,1,0,0,0,7,3,279,5,39,239.554,24,1,2,0,4
4,0,0,0,1,7,3,289,36,33,239.554,30,1,2,1,2

In [42]:
# Education column
df_mod['Education'].unique()

array([1, 3, 2, 4], dtype=int64)

In [44]:
df_mod['Education'].value_counts()

1    583
3     73
2     40
4      4
Name: Education, dtype: int64

In [45]:
df_mod['Education'] = df_mod['Education'].map({1:0, 2:1, 3:1, 4:1})

In [47]:
df_mod['Education'].value_counts()

0    583
1    117
Name: Education, dtype: int64

In [48]:
df_mod.to_csv('Absenteeism_preprocessed.csv', index=False)